{
  "info": {
    "name": "Emanuel",
    "title": "Full Stack Developer & Data Specialist",
    "location": "Kraków, Poland",
    "email": "ema_laiolo@gmail.com",
    "linkedin": "https://www.linkedin.com/in/emanuel-laiolo-300b31313",
    "github": "https://github.com/Emanuel-Laiolo/CvGenerator",
    "website": "https://emanuel-laiolo.github.io/CvGenerator/"
  },
  "summary": "Software Developer based in Kraków with 6+ years of experience. Dual Argentine/Italian citizen (EU work authorization). UTN Graduate (University Programmer). Expert in building full-stack web applications (React/TypeScript) and data analysis systems. Passionate about integrating AI into workflows; active user of Claude Code, Gemini, and Copilot to accelerate development. Open to remote projects with flexible hours.",
  "about": "Hello! My name is Emanuel. I was born in Argentina and currently live in Kraków, Poland. I am both an Argentine and an Italian citizen. I'd like to tell you a little about what I do and what I've been doing for the past six years (since I was 20), when I entered the IT world. I've always been around technology since I was a child, and I'm fascinated by its constant evolution. I have a degree in Computer Programming (UTN Argentina). I speak and write two languages fluently: English and Spanish.\n\nI'm passionate about AI and constantly learning and updating my skills.\n\nCV: https://emanuel-laiolo.github.io/CvGenerator/\n\nTechnologies and skills I use:\nI have a well-equipped setup for long work sessions. Flexible availability.\n\nI'm very intrigued and fascinated by learning and applying artificial intelligence in my life and projects. I currently use these tools for code/projects (Claude Code, Gemini, ChatRtx, Codex, and Copilot in VS Code) and for personal use, GPT-5.\n\nI'm the editor and administrator of the backend and frontend of \"Yogalorena.com,\" a website with payment and subscription systems that offers online yoga services. The technologies I used were: React with TypeScript, Vite (for a rapid development environment), Tailwind CSS, Shadcn UI, Frame Motion, a BaaS platform, PostgreSQL, Stripe, Cloudflare Stream, and Resend.\n\nAt 20, I created a mathematical bankroll management system, using solvers and a database for predicting equity, EV, risk and profit, probability, and statistics. I used several solvers and a multi-terabyte database.\n\nChatbots/Automation: I have experience training artificial intelligence models using Python. I also used Python to train a neural network that served as an OCR tool, comparing images to select an option.\n\nI'm happy to answer any questions about myself.\n\nI'm looking to join projects/jobs that require someone to work remotely, with flexible hours and adaptable to all types of projects/jobs, and interested in participating in worthwhile projects.",
  "skills": [
    "Frontend: React, TypeScript, Vite, Tailwind CSS, Framer Motion, Shadcn/ui",
    "Backend: Node.js, PostgreSQL, BaaS, Supabase, SQL, Stripe Integration",
    "AI Toolkit: Python, Claude Code, Gemini, ChatRTX, GitHub Copilot",
    "Languages: Spanish (Native), English (Fluent)"
  ],
  "experience": [
    {
      "role": "Lead Full Stack Developer & Administrator",
      "company": "Yogalorena.com",
      "dates": "Present",
      "description": "Developed and currently manage a VOD platform with payment and subscription systems for online yoga services. Built with a focus on rapid development environment and high performance.",
      "stack": "React, TypeScript, Vite, Tailwind CSS, Shadcn/ui, PostgreSQL, Stripe, Cloudflare Stream, Resend."
    },
    {
      "role": "AI & Python Automation Developer",
      "company": "Independent Projects",
      "dates": "2022 - 2024",
      "description": "Trained custom AI models using Python. Developed a Neural Network for OCR (Optical Character Recognition) to compare images and automate complex decision-making processes based on visual inputs.",
      "stack": "Python, Neural Networks, OCR, Image Processing."
    },
    {
      "role": "Algorithmic Data Analyst",
      "company": "Private Quantitative Project",
      "dates": "2018 - 2022",
      "description": "Created a mathematical bankroll management system at age 20. Utilized solvers and a multi-terabyte database to predict Equity, EV (Expected Value), risk, and profit based on statistical probability.",
      "stack": "SQL, Big Data (Multi-TB DB), Solvers, Statistics & Probability."
    }
  ],
  "education": [
    {
     "institution": "Universidad Tecnológica Nacional (UTN)",
  "degree": "University Programmer Technician",
  "year": "2018 - 2020",
  "description": "I graduate of 'University Technician in Programming' from the National Technical University of Argentina.",
  "subjects": [ 
    {"semester": "Primer Cuatrimestre", "courses": ["Programación I", "Arquitectura y Sistemas Operativos", "Matemática", "Organización empresarial"]},
    {"semester": "Segundo Cuatrimestre", "courses": ["Programación II", "Probabilidad y Estadística", "Base de Datos I", "Inglés I"]},
    {"semester": "Tercer Cuatrimestre", "courses": ["Programación III", "Base de Datos II", "Metodología de Sistemas I", "Inglés II"]},
    {"semester": "Cuarto Cuatrimestre", "courses": ["Programación IV", "Metodología de Sistemas II", "Introducción al análisis de datos", "Legislación", "Gestión de desarrollo de software"]}
  ]
    },
    {
      "degree": "Continuous Learning (AI & Tech)",
      "institution": "Self-taught",
      "year": "Ongoing",
      "description": "Advanced usage of AI tools for code optimization: Claude Code, Codex, ChatRTX and GPT-5 (Personal use)."
    }
  ]
}